/**
 * sketch.js
 *
 * p5.js 레퍼런스: http://p5js.org/reference
 * 웹기술 레퍼런스: http://developer.mozilla.org
 *
 * @author : https://github.com/Mosframe
 */


// -----------------------------------------------------------------
// 변수, 오브젝트 정의
// -----------------------------------------------------------------
var w;

// -----------------------------------------------------------------
// p5.js 함수들
// -----------------------------------------------------------------

function setup () {

    createP('주제 : 랜덤워커의 이동방향에 확률을 다르게 지정하였다.<br/>');

    createCanvas(800,600);

    w = new Walker();

    background(230);
}

function draw () {

    w.step();
    w.render();
}

// -----------------------------------------------------------------
// 사용자 정의 함수들
// -----------------------------------------------------------------
