/**
 * sketch.js
 *
 *
 * p5.js 레퍼런스: http://p5js.org/reference
 * 웹기술 레퍼런스: http://developer.mozilla.org
 *
 * @author : https://github.com/Mosframe
 */


// -----------------------------------------------------------------
// 변수, 오브젝트 정의
// -----------------------------------------------------------------
var socket;

// -----------------------------------------------------------------
// p5.js 함수들
// -----------------------------------------------------------------

function setup () {

    createCanvas(600, 400);
    background(51);

    //socket = io.connect('http://localhost:3000');
    socket = io();
}

function draw () {

    noStroke();
    fill(255);
    ellipse(mouseX,mouseY,36,36);
}

// -----------------------------------------------------------------
// 사용자 정의 함수들
// -----------------------------------------------------------------