/**
 * sketch.js
 *
 * p5.js 레퍼런스: http://p5js.org/reference
 * 웹기술 레퍼런스: http://developer.mozilla.org
 *
 * @author : https://github.com/Mosframe
 */


// -----------------------------------------------------------------
// 변수, 오브젝트 정의
// -----------------------------------------------------------------
var drop;

// -----------------------------------------------------------------
// p5.js 함수들
// -----------------------------------------------------------------

function preload () {

    createElement('h1','Purple Rain  : 보라색 비');
    createP('');
    createP('기본 프레임워크 생성');
}

function setup () {

    createCanvas(640,360);
    drop = new Drop();

}

function draw () {

    background(230, 230, 250);

    drop.fall();
    drop.show();
}

// -----------------------------------------------------------------
// 사용자 정의 함수들
// -----------------------------------------------------------------
