/**
 * sketch.js
 *
 *
 * p5.js 레퍼런스: http://p5js.org/reference
 * 웹기술 레퍼런스: http://developer.mozilla.org
 *
 * @author : https://github.com/Mosframe
 */


// -----------------------------------------------------------------
// 변수, 오브젝트 정의
// -----------------------------------------------------------------
var video;

// -----------------------------------------------------------------
// p5.js 함수들
// -----------------------------------------------------------------

function setup () {

    createCanvas(320, 240);
    background(51);
    video = createCapture(VIDEO);
    video.size(320,240);
    video.hide();
}

function draw () {
    tint(255,150,100);
    image(video,0,0,width,height);
}

// -----------------------------------------------------------------
// 사용자 정의 함수들
// -----------------------------------------------------------------