/**
 * sketch.js
 *
 * 거품 그리기
 *
 * 레퍼런스: http://p5js.org/reference
 *
 * @author : https://github.com/Mosframe
 */


// -----------------------------------------------------------------
// 변수, 오브젝트 정의
// -----------------------------------------------------------------
var words = ["rainbow", "heart", "purple", "friendship", "love"];

var index = 0;

// -----------------------------------------------------------------
// p5함수들
// -----------------------------------------------------------------

// 설정

function setup () {

    createCanvas(600,400);

}

// 디스플레이

function draw () {

    background(0);

    fill(255);
    textSize(32);
    text( words[index], 12, 200 );
}

function mousePressed() {

    index = index + 1;
    if( index == words.length ) {
        index = 0;
    }
}

// -----------------------------------------------------------------
// 사용자 정의 함수들
// -----------------------------------------------------------------


