/**
 * sketch.js
 *
 * p5.js 레퍼런스: http://p5js.org/reference
 * 웹기술 레퍼런스: http://developer.mozilla.org
 *
 * @author : https://github.com/Mosframe
 */


// -----------------------------------------------------------------
// 변수, 오브젝트 정의
// -----------------------------------------------------------------
var mic

// -----------------------------------------------------------------
// p5.js 함수들
// -----------------------------------------------------------------

function setup () {

    createCanvas(200,200);

    mic = new p5.AudioIn();
    mic.start();

}


function draw () {

    background(0);

    var vol = mic.getLevel();
    //console.log(vol);

    ellipse( width/2, height/2, width, vol*height );

}

// -----------------------------------------------------------------
// 사용자 정의 함수들
// -----------------------------------------------------------------
