/**
 * sketch.js
 *
 * p5.js 레퍼런스: http://p5js.org/reference
 * 웹기술 레퍼런스: http://developer.mozilla.org
 *
 * @author : https://github.com/Mosframe
 */


// -----------------------------------------------------------------
// 변수, 오브젝트 정의
// -----------------------------------------------------------------

// -----------------------------------------------------------------
// p5.js 함수들
// -----------------------------------------------------------------

function setup () {

    createP('주제 : 가우스 분포를 이용한 무작위값을 본다.<br/>');

    createCanvas(400,400);
}

function draw () {

    background(230);

    var h = randomGaussian();
    h = h * 10;
    h = h + 100;

    fill(0);
    ellipse(width/2,height/2,h,h);
}

// -----------------------------------------------------------------
// 사용자 정의 함수들
// -----------------------------------------------------------------
